cf/Catalogs/Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Напоминания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОткрыто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОткрыл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/НапоминанияСервер/Ext/Module.bsl
Функция ПолучитьНапоминания() Экспорт
	
	ЖизньОткрытияНапоминания = 60 * 60; // если больше часа то тогда можно открывать и другому
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ	Ссылка, ДатаНапоминания, Текст
	|ИЗ 		Справочник.Напоминания
	|
	|ГДЕ	ДатаНапоминания < &ТекущаяДата И
	|		(	НапоминаниеОткрыто = &ПустаяДата Или 
	|			ДОБАВИТЬКДАТЕ(НапоминаниеОткрыто, СЕКУНДА, &Жизнь) < &ТекущаяДата 
	|		) И
	|
	|		(
	|			Пользователь = &Пользователь ИЛИ
	|
	|			(	Пользователь = &ПустойПользователь И 
	|				Роль В(&РолИ) И
	|				Склад = &ПустойСклад
	|			) ИЛИ
	|
	|			(	Пользователь = &ПустойПользователь И 
	|				Роль = &ПустаяРоль И 
	|				Склад В(&Склады)
	|			)ИЛИ
	|
	|			(	Пользователь = &ПустойПользователь И 
	|				Роль В(&РолИ) И 
	|				Склад В(&Склады)
	|			)
	|		)
	|");
	
	Запрос.УстановитьПараметр("Пользователь", 	ПараметрыСеанса.ТекущийПользователь);
	//Запрос.УстановитьПараметр("Склад", 			ПараметрыСеанса.ТекущийСклад);
	Запрос.УстановитьПараметр("Склады", 		ПараметрыСеанса.ТекущиеСклады);
	Запрос.УстановитьПараметр("РолИ", 			ПараметрыСеанса.ТекущиеРоли);
	
	Запрос.УстановитьПараметр("ПустойПользователь", 	Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяРоль", 			Справочники.Роли.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСклад", 			Справочники.Склады.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ПустаяДата",		'00010101');
	Запрос.УстановитьПараметр("Жизнь",			ЖизньОткрытияНапоминания);
	Запрос.УстановитьПараметр("ТекущаяДата",	ТекущаяДата());
	
	Выполнение = Запрос.Выполнить();
	Если Выполнение.Пустой() Тогда
		
		Возврат Новый Массив; // вернем пустой массив
		
	Иначе
		
		Возврат КонвертацияТипов.ПолучитьМассивИзТаблицыЗначений(Выполнение.Выгрузить());
		
	КонецЕсли;
	
КонецФункции

Функция УстановитьНапоминание(Адресация, Источник, Текст) Экспорт
	
	НовСпр = Справочники.Напоминания.СоздатьЭлемент();
	
	НовСпр.ДатаНапоминания 	= ТекущаяДата();
	НовСпр.Источник 		= Источник;
	НовСпр.Текст 			= Текст;
	
	Адресация.Свойство("Склад", 		НовСпр.Склад);
	Адресация.Свойство("Роль", 			НовСпр.Роль);
	Адресация.Свойство("Пользователь", 	НовСпр.Пользователь);
	
	Попытка
		
		НовСпр.Записать();
		
	Исключение
		
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции

Функция УдалитьНапоминаниеПоИсточнику(Источник) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Напоминания ГДЕ Источник = &Источник");
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Ошибка 	= Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Выборка.Ссылка.ПолучитьОбъект().Удалить();
		Исключение
			ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
			Ошибка = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Не Ошибка;
	
КонецФункции
